src/InformationRegisters/ЖурналЗапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЖурналЗапросов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗапросов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.HTTPСервисы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСостояния</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешнееПриложение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ApiKey</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БазовыйURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтносительныйURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>HTTPМетод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>HTTPШаблон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UserToken</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПараметрыЗапроса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЭвотор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исходящий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>UIDЗапроса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/HTTPСервисы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>HTTPСервисы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Analytics</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>API</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Apex</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Director</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Evotor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IPТелефония</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IronLogic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JivoSite</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Lead</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Mandarin</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Messenger</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧатБот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BePaid</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыВнешнихСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыВнешнихСистем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Calltouch</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Chat2Desk</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CoMagic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GreenApi</Name>
					<Comment>WhatsApp</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IPТелефония</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JivoSite</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Marquiz</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Roistat</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TapLink</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Telegram</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Tilda</Name>
					<Comment>Ловец лидов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Viber</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Vkontakte</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VkontakteApi</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wallet</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Webhook</Name>
					<Comment>Получение лидов стандартный набор параметров</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВиджетОнлайнЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИЭМК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтурСтрахование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложениеУправляющего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценкиИОтзывы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроДокторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексМетрика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыЗапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыЗапросов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>TimedOut</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенСОшибками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Начало</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаApiKey</Name>
					<Comment>Не передан ApiKey</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаАвторизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаВнешнейСистемы</Name>
					<Comment>Не найдена внешняя система</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаСоединения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОбработана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПропущенныйЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтвеченныйЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтвеченныйДиалог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перезвонить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принята</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыСквознойАналитики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыСквознойАналитики</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаОтклонена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаПринята</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаНеСоздана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаНеСостоялась</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСменаЭтапа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСоздана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСостоялась</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаУдалена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоциальнаяСеть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КороткийАдрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Координаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексОтзывы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/РезультатыСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РезультатыСделок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Успех</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыОбращенийCoMagic.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыОбращенийCoMagic</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>call</Name>
					<Comment>Звонок</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>chat</Name>
					<Comment>Чат</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>goal</Name>
					<Comment>Цель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>offline_message</Name>
					<Comment>Заявка</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/HTTPServices/Analytics/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

// Функция, получает вебхуки с сервиса Сalltouch.
//
Функция CalltouchPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		api_key = Сред(Запрос.ОтносительныйURL, 12, СтрДлина(Запрос.ОтносительныйURL));
		
		// Логирование
		ЛогироватьСобытие = Ложь; // Константы.ЛогироватьHTTP.Получить();	
		
		Если ЛогироватьСобытие > 0 Тогда
			ВремяНачалаОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
			UIDЗапроса     = Новый УникальныйИдентификатор();
			HTTPЗапросЛога = Запрос;
			ДатаЛога       = ТекущаяДатаСеанса();
			ТипЗапроса     = Перечисления.HTTPСервисы.Analytics;
			HTTPШаблон     = "Calltouch";
		КонецЕсли;
		//\\
		
		ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(api_key, Перечисления.ТипыВнешнихСистем.Calltouch);
		Если НЕ ЗначениеЗаполнено(ВнешняяСистема) Тогда
			
			Ответ = Новый HTTPСервисОтвет(400, "Не найдена внешняя система");
			
			// Логирование
			Если ЛогироватьСобытие > 0 Тогда
				
				ВремяОкончанияОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
				ВремяВыполнения        = (ВремяОкончанияОперации - ВремяНачалаОперации)/1000;
				СтатусСобытия          = Перечисления.СтатусыЗапросов.ЗавершенСОшибками;
				мОтвет                 = Ответ.ПолучитьТелоКакСтроку();				
				РегистрыСведений.ЖурналЗапросов.ЛогироватьЗапрос(
				HTTPЗапросЛога, 
				ДатаЛога, 
				UIDЗапроса, 
				ТипЗапроса, 
				HTTPШаблон, 
				СтатусСобытия, 
				ВремяВыполнения, 
				, 
				, 
				мОтвет, 
				, 
				,
				400); 								
				
			КонецЕсли;
			
			Возврат Ответ;
			
		КонецЕсли;
		
		ТелоЗапроса   = РаскодироватьСтроку(Запрос.ПолучитьТелоКакСтроку(), СпособКодированияСтроки.КодировкаURL);	
		ПараметрыТела = Новый Структура();
		
		Для Каждого ЭлементМассива Из СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТелоЗапроса, "&") Цикл	
			Массив = СтрРазделить(ЭлементМассива, "=");
			РаспарситьСтроку(ПараметрыТела, Массив[0], Массив[1]); 				
		КонецЦикла;
		
		// Если тестовый запрос.
		Если ПараметрыТела.Свойство("requestId") И ПараметрыТела.requestId = "{requestId}" Тогда
			
			Ответ = Новый HTTPСервисОтвет(200, "Тестовый запрос");
			
			// Логирование
			Если ЛогироватьСобытие > 0 Тогда
				
				ВремяОкончанияОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
				ВремяВыполнения        = (ВремяОкончанияОперации - ВремяНачалаОперации)/1000;
				СтатусСобытия          = Перечисления.СтатусыЗапросов.Выполнен;
				мОтвет                 = Ответ.ПолучитьТелоКакСтроку();				
				
				Если ОбщегоНазначения.ВыполнитьЛогированиеЗапроса(ЛогироватьСобытие, СтатусСобытия, ВремяВыполнения)Тогда
					
					РегистрыСведений.ЖурналЗапросов.ЛогироватьЗапрос(
					HTTPЗапросЛога, 
					ДатаЛога, 
					UIDЗапроса, 
					ТипЗапроса, 
					HTTPШаблон, 
					СтатусСобытия, 
					ВремяВыполнения, 
					ВнешняяСистема, 
					api_key, 
					мОтвет, 
					, 
					,
					200); 								
				КонецЕсли;
			КонецЕсли;
			
			Возврат Ответ;
			
		КонецЕсли;
		
		// Если Звонок, то будем обогощать звонки информаций от коллтрекинга.
		Если ПараметрыТела.Свойство("leadtype") И ПараметрыТела.leadtype = "call" Тогда
			
			// Если в Calltouch фиксируется начало и окончание звонка, то не создаем заявку дважды.
			Если ПараметрыТела.Свойство("callphase") И ПараметрыТела.callphase = "calldisconnected" Тогда
				
				Ответ = Новый HTTPСервисОтвет(200, "Окончание звонка");
				
				// Логирование
				Если ЛогироватьСобытие > 0 Тогда
					
					ВремяОкончанияОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
					ВремяВыполнения        = (ВремяОкончанияОперации - ВремяНачалаОперации)/1000;
					СтатусСобытия          = Перечисления.СтатусыЗапросов.Выполнен;
					мОтвет                 = Ответ.ПолучитьТелоКакСтроку();	
					Если ОбщегоНазначения.ВыполнитьЛогированиеЗапроса(ЛогироватьСобытие, СтатусСобытия, ВремяВыполнения) Тогда
						
						РегистрыСведений.ЖурналЗапросов.ЛогироватьЗапрос(
						HTTPЗапросЛога, 
						ДатаЛога, 
						UIDЗапроса, 
						ТипЗапроса, 
						HTTPШаблон, 
						СтатусСобытия, 
						ВремяВыполнения, 
						ВнешняяСистема, 
						api_key, 
						мОтвет, 
						, 
						,
						200); 								
					КонецЕсли;
					
				КонецЕсли;
				
				Возврат Ответ;
				
			КонецЕсли;

		КонецЕсли;	
			
		Если ПараметрыТела.Свойство("leadtype") И (ПараметрыТела.leadtype = "request" Или ПараметрыТела.leadtype = "call") Тогда
			
					
			leadtype 			 = ?(ПараметрыТела.Свойство("leadtype")		, ПараметрыТела.leadtype	, Неопределено);
			subject 			 = ?(ПараметрыТела.Свойство("subject")		, ПараметрыТела.subject		, Неопределено);
			ИдентификаторЗаявки  = ?(ПараметрыТела.Свойство("requestId") 	, ПараметрыТела.requestId  	, Неопределено);
			ВремяСозданияЗаявки	 = ?(ПараметрыТела.Свойство("requestDate")	, ПараметрыТела.requestDate	, Неопределено);
			ФИО                  = ?(ПараметрыТела.Свойство("fio")        	, ПараметрыТела.fio        	, Неопределено);
			НомерТелефона        = ?(ПараметрыТела.Свойство("callerphone")	, ПараметрыТела.callerphone	, Неопределено);
			АдресЭП              = ?(ПараметрыТела.Свойство("email")      	, ПараметрыТела.email      	, Неопределено);
			utm_campaign		 = ?(ПараметрыТела.Свойство("utm_campaign")	, ПараметрыТела.utm_campaign, Неопределено);
			utm_content	    	 = ?(ПараметрыТела.Свойство("utm_content") 	, ПараметрыТела.utm_content , Неопределено);
			// utm_medium	    	 = ?(ПараметрыТела.Свойство("utm_medium")  	, ПараметрыТела.utm_medium  , Неопределено);
			// utm_source	    	 = ?(ПараметрыТела.Свойство("utm_source")  	, ПараметрыТела.utm_source  , Неопределено);
			utm_term	    	 = ?(ПараметрыТела.Свойство("utm_term")    	, ПараметрыТела.utm_term    , Неопределено);
			ct_cid		    	 = ?(ПараметрыТела.Свойство("sessionId")    , ПараметрыТела.sessionId   , Неопределено);
			ga_cid		    	 = ?(ПараметрыТела.Свойство("gcid")    		, ПараметрыТела.gcid   		, Неопределено);
			ym_cid		    	 = ?(ПараметрыТела.Свойство("yaClientId")   , ПараметрыТела.yaClientId  , Неопределено);
			Источник	    	 = ?(ПараметрыТела.Свойство("source")   	, ПараметрыТела.source   	, Неопределено);
			Канал		    	 = ?(ПараметрыТела.Свойство("medium")   	, ПараметрыТела.medium   	, Неопределено);
			РекламнаяСсылка    	 = ?(ПараметрыТела.Свойство("url")   		, ПараметрыТела.url   		, Неопределено);
			
			Если ПараметрыТела.Свойство("utm_source") Тогда
				utm_source = ?(ПараметрыТела.utm_source = "<не+указано>", Источник, ПараметрыТела.utm_source);
			Иначе
				utm_source = Неопределено;
			КонецЕсли;
			
			Если ПараметрыТела.Свойство("utm_medium") Тогда
				utm_medium = ?(ПараметрыТела.utm_medium = "<не+указано>", Канал, ПараметрыТела.utm_medium);
			Иначе
				utm_medium = Неопределено;
			КонецЕсли;
			
			МассивКомментариев   = ?(ПараметрыТела.Свойство("comment")    	, ПараметрыТела.comment    	, Неопределено);
			ВремяСоздания		 = ПолучитьДатуИзСтрокиCoMagic(ВремяСозданияЗаявки);
			
			Комментарий          = "Заявка создана сервисом Calltouch " + ВремяСоздания + "." + Символы.ПС;
			
			Если ЗначениеЗаполнено(subject) Тогда
				Комментарий = Комментарий + "Форма заявки: """ + СтрЗаменить(subject, "+", " ") + """." + Символы.ПС;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(МассивКомментариев) И ТипЗнч(МассивКомментариев) = Тип("Массив") И МассивКомментариев.Количество() > 0 Тогда
				Для Каждого СтрокаМ Из МассивКомментариев Цикл
					Комментарий = Комментарий + СтрокаМ.comment + Символы.ПС;
				КонецЦикла;
			КонецЕсли;
			
			Клиент = Неопределено;
			Если ЗначениеЗаполнено(НомерТелефона) Тогда
				Клиент = Справочники.Контрагенты.ПолучитьКонтрагентаПоНомеруТелефона(НомерТелефона);
			КонецЕсли;
			
			Фамилия  = Неопределено;
			Имя      = Неопределено;
			Отчество = Неопределено;
			
			МассивФИО = СтрРазделить(ФИО, "+"); 
			
			Если МассивФИО.Количество() > 0 Тогда
				Фамилия = СокрЛП(МассивФИО[0]);		
			КонецЕсли;
			
			Если МассивФИО.Количество() > 1 Тогда
				Имя = СокрЛП(МассивФИО[1]);	
			КонецЕсли;
			
			Если МассивФИО.Количество() > 2 Тогда
				Отчество = СокрЛП(МассивФИО[2]);	
			КонецЕсли;
					
			Заявка	= ПолучитьЗаявкуКлиентаCalltouch(ct_cid, ИдентификаторЗаявки);
			
			Если Не ЗначениеЗаполнено(Заявка) Тогда
				
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("ДатаСоздания"      			, ?(ЗначениеЗаполнено(ВремяСоздания), ВремяСоздания, ТекущаяДатаСеанса()));	
				СтруктураПараметров.Вставить("Фамилия"           			, Фамилия);	
				СтруктураПараметров.Вставить("Имя"               			, Имя);	
				СтруктураПараметров.Вставить("Отчество"          			, Отчество);	
				СтруктураПараметров.Вставить("НомерТелефона"    			, НомерТелефона);
				СтруктураПараметров.Вставить("АдресЭП"           			, АдресЭП);	
				
				ПараметрыПоиска = Новый Структура();
				ПараметрыПоиска.Вставить("source"		, utm_source);
				ПараметрыПоиска.Вставить("medium"		, utm_medium);
				ПараметрыПоиска.Вставить("campaign"		, utm_campaign);
				ПараметрыПоиска.Вставить("content"		, utm_content);
				ПараметрыПоиска.Вставить("term"			, utm_term);
				ПараметрыПоиска.Вставить("комментарий"	, Комментарий);
				РекламныйИсточникПоМеткамUTM = Справочники.РекламныеИсточники.ПолучитьРекламныйИсточникПоПараметрамЗаявки(ПараметрыПоиска);
				СтруктураПараметров.Вставить("РекламныйИсточник" 			, ?(РекламныйИсточникПоМеткамUTM = Неопределено, Справочники.РекламныеИсточники.ПолучитьРекламныйИсточник(Источник), РекламныйИсточникПоМеткамUTM));
				
				СтруктураПараметров.Вставить("РекламнаяПлощадка" 			, Справочники.КаналыПривлечения.ПолучитьКаналПривлечения(Канал));
				СтруктураПараметров.Вставить("РекламнаяСсылка"   			, РекламнаяСсылка);	
				СтруктураПараметров.Вставить("Комментарий"       			, Комментарий);	
				СтруктураПараметров.Вставить("communication_id"  			, ИдентификаторЗаявки);	
				СтруктураПараметров.Вставить("communication_type"			, leadtype);	
				СтруктураПараметров.Вставить("ВнешняяСистема"    			, ВнешняяСистема);	
				СтруктураПараметров.Вставить("СтруктурнаяЕдиница"			, ВнешняяСистема.СтруктурнаяЕдиница);	
				СтруктураПараметров.Вставить("source"  						, utm_source  );
				СтруктураПараметров.Вставить("medium"  						, utm_medium  );
				СтруктураПараметров.Вставить("campaign"						, utm_campaign);
				СтруктураПараметров.Вставить("content" 						, utm_content );
				СтруктураПараметров.Вставить("term"    						, utm_term    );
				СтруктураПараметров.Вставить("ga_cid"  						, ga_cid      );
				СтруктураПараметров.Вставить("ym_cid"  						, ym_cid      );
				СтруктураПараметров.Вставить("ct_cid"  						, ct_cid	  );
			
				// Создаем заявку.
				Заявка = Справочники.Заявки.СоздатьЗаявку(СтруктураПараметров);
				
			КонецЕсли;
		КонецЕсли 
		
	Исключение
		// Логирование
		Если ЛогироватьСобытие > 0 Тогда
			
			ВремяОкончанияОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ВремяВыполнения        = (ВремяОкончанияОперации - ВремяНачалаОперации)/1000;
			ИнформацияОбОшибке     = ИнформацияОбОшибке();
			ОписаниеОшибки         = ИнформацияОбОшибке.Причина.Описание;
			Если СтрНайти(ИнформацияОбОшибке.Причина.Описание, "Превышено время ожидания") > 0 Тогда						
				СтатусСобытия = Перечисления.СтатусыЗапросов.TimedOut;
			Иначе
				СтатусСобытия = Перечисления.СтатусыЗапросов.ОшибкаСоединения;
			КонецЕсли;
			
			РегистрыСведений.ЖурналЗапросов.ЛогироватьЗапрос(
			HTTPЗапросЛога, 
			ДатаЛога, 
			UIDЗапроса, 
			ТипЗапроса, 
			HTTPШаблон, 
			СтатусСобытия, 
			ВремяВыполнения, 
			ВнешняяСистема, 
			api_key,  
			ОписаниеОшибки, 
			, 
			,
			400); 								
			
		КонецЕсли;
		
		Возврат Новый HTTPСервисОтвет(400);
		
	КонецПопытки;
	
	Ответ = Новый HTTPСервисОтвет(200, "Заявка успешно создана");
	
	// Логирование
	Если ЛогироватьСобытие > 0 Тогда
		
		ВремяОкончанияОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ВремяВыполнения        = (ВремяОкончанияОперации - ВремяНачалаОперации)/1000;
		СтатусСобытия          = Перечисления.СтатусыЗапросов.Выполнен;
		мОтвет                 = Ответ.ПолучитьТелоКакСтроку();				
		
		Если ОбщегоНазначения.ВыполнитьЛогированиеЗапроса(ЛогироватьСобытие, СтатусСобытия, ВремяВыполнения) Тогда
			
			РегистрыСведений.ЖурналЗапросов.ЛогироватьЗапрос(
			HTTPЗапросЛога, 
			ДатаЛога, 
			UIDЗапроса, 
			ТипЗапроса, 
			HTTPШаблон, 
			СтатусСобытия, 
			ВремяВыполнения, 
			ВнешняяСистема, 
			api_key, 
			мОтвет, 
			, 
			,
			200); 								
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// Функция, возвращает заявку клиента из формы оплаты.
//
Функция ПолучитьЗаявкуКлиентаCalltouch(ct_cid, communication_id)
	
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Заявки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Заявки КАК Заявки
	|ГДЕ
	|	НЕ Заявки.ПометкаУдаления
	|	И Заявки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявок.НеОбработана)
	|	И (Заявки.ct_cid = &ct_cid
	|			ИЛИ Заявки.communication_id = &communication_id)");
	
	Запрос.УстановитьПараметр("ct_cid"	 , ct_cid);
	Запрос.УстановитьПараметр("communication_id" , communication_id);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
	
КонецФункции

// Процедура - Распарсить строку
//
Процедура РаспарситьСтроку(ПараметрыТела, Ключ, Значение) 	
	
	Если СтрНайти(Ключ, "[") <> 0 Тогда
		
		Ключ = СтрРазделить(Ключ, "[");
		Если Прав(Ключ[1], 1) = "]" Тогда
			Ключ[1] = Лев(Ключ[1], СтрДлина(Ключ[1]) - 1);
		КонецЕсли;
		
		Попытка
			Ключ[0] = Число(Ключ[0]);
		Исключение
		КонецПопытки;  		
		
		Если ТипЗнч(Ключ[0]) <> Тип("Число") 
			И Не ПараметрыТела.Свойство(Ключ[0]) Тогда 
			
			Попытка
				
				Если Ключ.Количество() > 1 Тогда 
					
					Индекс = Число(Лев(Ключ[1], 1));					
					ПараметрыТела.Вставить(Ключ[0], Новый Массив());
					
				КонецЕсли;
				
			Исключение
				ПараметрыТела.Вставить(Ключ[0], Новый Структура());				
			КонецПопытки;
			
		КонецЕсли;
		
		Если Ключ.Количество() > 2 Тогда
			
			Пока Ключ.Количество() > 1 Цикл
				
				времКлюч = "" + времКлюч + Ключ[1] + ?(Ключ.Количество()>2, "[", "");
				
				Ключ.Удалить(1);
				
			КонецЦикла;
			
			РаспарситьСтроку(ПараметрыТела[Ключ[0]], времКлюч, Значение);
		Иначе
			
			Если ТипЗнч(Ключ[0]) = Тип("Число") 
				И ТипЗнч(ПараметрыТела) = Тип("Массив") 
				И ПараметрыТела.Количество() = Ключ[0] Тогда 
				ПараметрыТела.Добавить(Новый Структура());				
			КонецЕсли;
			РаспарситьСтроку(ПараметрыТела[Ключ[0]], Ключ[1], Значение);
			
		КонецЕсли;	
		
	Иначе 
		RawDataВСтруктуру(ПараметрыТела, Ключ, Значение);			
	КонецЕсли;
	
КонецПроцедуры   

// Процедура - Raw data в структуру
//
Процедура RawDataВСтруктуру(ПараметрыТела, Ключ, Значение)
	
	Если Лев(Ключ, 1) = "[" Тогда
		Ключ = Прав(Ключ, СтрДлина(Ключ) - 1);
	КонецЕсли; 	
	Если СтрНайти(Ключ, "-") <> 0 Тогда
		Ключ = СтрЗаменить(Ключ, "-", "_");
	КонецЕсли;
	ПараметрыТела.Вставить(Ключ, Значение);			
	
КонецПроцедуры

// Функция, преобразует строку в дату.
//
Функция ПолучитьДатуИзСтрокиCoMagic(СтроковаяДата) 
	
	Попытка
		
		СтроковаяДата = СтрЗаменить(СтроковаяДата, "-","");
		СтроковаяДата = СтрЗаменить(СтроковаяДата, ":","");
		СтроковаяДата = СтрЗаменить(СтроковаяДата, "T","");
		СтроковаяДата = СтрЗаменить(СтроковаяДата, " ","");
		СтроковаяДата = СтрЗаменить(СтроковаяДата, "+","");
		
		Если СтрДлина(СтроковаяДата) < 12 Тогда 
			Возврат Неопределено;
		КонецЕсли;	
		
		СтроковаяДата = ?(СтрДлина(СтроковаяДата) = 12, СтроковаяДата + "00", СтроковаяДата);
		СтроковаяДата = ?(СтрДлина(СтроковаяДата) > 14, Лев(СтроковаяДата, 14), СтроковаяДата);
		
		Возврат Дата(СтроковаяДата);
		
	Исключение
		Возврат Неопределено;		
	КонецПопытки;
	
КонецФункции

// Функция, возвращает Json структуру статусов. 
//
Функция ПолучитьJsonСтруктуруСхемыИмпорта()
	
	// СписокСделок       = РегистрыСведений.СтекИзмененийСтатусовСквознойАналитики.ПолучитьСписокССА();
	
	СписокСотрудников    = ПолучитьСписоксотрудников();
	
	Статусы = "{
	|""statuses"": [
	|{""id"": ""101"", ""name"": """ + Строка(Перечисления.СтатусыСквознойАналитики.ЗаявкаОтклонена)    + """},
	|{""id"": ""102"", ""name"": """ + Строка(Перечисления.СтатусыСквознойАналитики.ЗаявкаПринята)      + """},
	|{""id"": ""103"", ""name"": """ + Строка(Перечисления.СтатусыСквознойАналитики.СделкаСоздана)      + """},
	|{""id"": ""106"", ""name"": """ + Строка(Перечисления.СтатусыСквознойАналитики.СделкаСменаЭтапа)   + """},
	|{""id"": ""104"", ""name"": """ + Строка(Перечисления.СтатусыСквознойАналитики.СделкаСостоялась)   + """},
	|{""id"": ""105"", ""name"": """ + Строка(Перечисления.СтатусыСквознойАналитики.СделкаНеСостоялась) + """}
	|],
	|""fields"": [],";
	
	МенеджерыНачало = "
	|""managers"": [";
	
	МенеджерыСередина = "";
	Для Каждого СтрокаТЧ Из СписокСотрудников Цикл
		
		МассивТелефонов = Новый Массив;
		МассивEmail = Новый Массив;
		
		// Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Менеджер",,СтрокаТЧ.Объект) Тогда
		//	ОсновнойМенеджер = СтрокаТЧ.Объект.Менеджер;
		// Иначе
		//	ОсновнойМенеджер = СтрокаТЧ.Объект.ОсновнойМенеджер;
		// КонецЕсли;
		
		МассивТелефонов = СтрокаТЧ.Ссылка.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон));
		МассивEmail = СтрокаТЧ.Ссылка.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты));
		
		Если ЗначениеЗаполнено(СтрокаТЧ.Ссылка.Наименование) Тогда
			МенеджерыСередина = МенеджерыСередина + "{
			|""id"": """ + СтрокаТЧ.Ссылка.УникальныйИдентификатор() + """,
			|""name"": """ + СтрокаТЧ.Ссылка.Наименование + """," + 
			?(МассивТелефонов.Количество() > 0, """phone"": """ + МассивТелефонов[0].НомерТелефона + """ ", "") +
			?(МассивEmail.Количество() > 0, ?(МассивТелефонов.Количество() = 0, """email"": """,",""email"": """) + МассивEmail[0].Представление + """ ", "") + "},";
			Если МассивТелефонов.Количество() = 0 И МассивEmail.Количество() = 0 Тогда
				МенеджерыСередина = Лев(МенеджерыСередина, СтрДлина(МенеджерыСередина)-3) + "},";	
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	МенеджерыСередина = Лев(МенеджерыСередина, СтрДлина(МенеджерыСередина)-1);
	
	МенеджерыКонец = "
	|]
	|}";
	
	// 	|{""id"": ""201"", ""name"": ""Выручка111""}
	
	Менеджеры = МенеджерыНачало + МенеджерыСередина + МенеджерыКонец;
	
	РезультатСхема = Статусы + Менеджеры;
	
	Возврат РезультатСхема;
	
КонецФункции	

// Функция, возвращает Json структуру Клиентов. 
//
Функция ПолучитьJsonСтруктуруКлиентов(ДатаСделок)
	
	СписокСделок 	   = ПолучитьСписокСделок(ДатаСделок);

	КлиентыНачало = "{
	|""clients"": [";
	
	КлиентыСередина = "";
	Для Каждого СтрокаТЧ Из СписокСделок Цикл

		МассивТелефонов = СтрокаТЧ.Ссылка.Контрагент.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон));
		МассивEmail = СтрокаТЧ.Ссылка.Контрагент.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты));

		КлиентыСередина = КлиентыСередина + "{
		    |""id"": """ + СтрокаТЧ.Ссылка.Контрагент.УникальныйИдентификатор() + """,
            |""name"": """ + СтрокаТЧ.Ссылка.Контрагент.Наименование + ?(МассивТелефонов.Количество() > 0 Или МассивEmail.Количество() > 0,"""," , """") + 
			?(МассивТелефонов.Количество() > 0, """phone"": """ + МассивТелефонов[0].НомерТелефона + """ ", "") +
			?(МассивEmail.Количество() > 0, ?(МассивТелефонов.Количество() = 0, """email"": """,",""email"": """) + МассивEmail[0].Представление + """ ", "") + 
			?(СтрокаТЧ.Ссылка.Контрагент.ДатаРожденияКлиента = Дата(1,1,1), "", ",""birth_date"": """ + Формат(СтрокаТЧ.Ссылка.Контрагент.ДатаРожденияКлиента, "ДФ='гггг-ММ-дд'") + """" ) + "},";
	КонецЦикла;
	КлиентыСередина = Лев(КлиентыСередина, СтрДлина(КлиентыСередина)-1);
	   
	КлиентыКонец = "
	|]
	|}";
	
	РезультатСхема = КлиентыНачало + КлиентыСередина + КлиентыКонец;
	
	Возврат РезультатСхема;
	
КонецФункции

// Функция, возвращает Json структуру экспорта заявок. 
//
Функция ПолучитьJsonСтруктуруЭкспортаЗаявок(ДатаСделок)
	
	// ---------------Соотвествие статусов и id----------------
	//_______________ЗаявкаОтклонена        101_______________
	//_______________ЗаявкаПринята          102_______________
	//_______________СделкаСоздана          103_______________
	//_______________СделкаСостоялась       104_______________
	//_______________СделкаНеСостоялась     105_______________
	
	// СписокСделок       = РегистрыСведений.СтекИзмененийСтатусовСквознойАналитики.ПолучитьСписокССА(Перечисления.ТипыВнешнихСистем.Roistat);
	СписокСделок 	   = ПолучитьСписокСделок(ДатаСделок);
	// total_count and limit, в рамках текущей политики.
	КоличествоСделок   = СписокСделок.Количество();
	JsonБлокPoganition = ПолучитьJsonБлокPoganition(КоличествоСделок);
	JsonБлокOrders	   = ПолучитьJsonБлокOrders(СписокСделок);
	
	Возврат "{ " + JsonБлокPoganition + " " + JsonБлокOrders + " }";   
	        
КонецФункции	

// Функция возвращает json блок poganition.
//
Функция ПолучитьJsonБлокPoganition(КоличествоСделок)
	
	Возврат "
	|""pagination"": {
	|""total_count"": " + Формат(КоличествоСделок, "ЧН=0; ЧГ=") + ",
	|""limit"": "       + Формат(1000, "ЧН=0; ЧГ=") + "     
	|}, ";
	
КонецФункции	

// Функция возвращает json блок poganition.
//
Функция ПолучитьСписокСделок(ДатаСделок)
	       
	ДатаНачала = Дата('19700101') + ДатаСделок;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сделки.Ссылка КАК Ссылка,
	|	Сделки.ДатаСделки КАК ДатаСделки
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|ГДЕ
	|	Сделки.ДатаСделки > &ДатаНачала
	|	И НЕ Сделки.ПометкаУдаления
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСделки");
	
	Запрос.УстановитьПараметр("ДатаНачала"      , ДатаНачала);
	
	Результат = Запрос.Выполнить().Выгрузить();
		
	Возврат Результат;
	
КонецФункции

// Функция возвращает список сотрудников.
//
Функция ПолучитьСписоксотрудников()
	       
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	НЕ Сотрудники.ПометкаУдаления");
	
	Результат = Запрос.Выполнить().Выгрузить();
		
	Возврат Результат;
	
КонецФункции

// Функция, возвращает Json блок Orders. 
//
Функция ПолучитьJsonБлокOrders(СписокСделок) 
	
	JsonМассивOrders = """orders"": [";
	ПервоеВхождение  = Истина;	
	
	Для Каждого СтрокаТЧ Из СписокСделок Цикл
		
		JsonМассивOrders = ?(НЕ ПервоеВхождение, JsonМассивOrders + ", ", JsonМассивOrders);
		IdСтатуса        =  Формат(ПолучитьIdСтатуса(СтрокаТЧ), "ЧГ=");
		
		// unixtime = Формат(УниверсальноеВремя(СтрокаТЧ.Объект.ДатаСделки), "ДФ='гггг-ММ-дд ЧЧ:мм'");
		Если IdСтатуса = "103" Тогда
			unixtime = Формат(УниверсальноеВремя(СтрокаТЧ.Ссылка.ДатаСделки), "ДФ='гггг-ММ-дд ЧЧ:мм'");
			ДатаСделки = СтрокаТЧ.Ссылка.ДатаСделки;
		Иначе
			unixtime = Формат(СтрокаТЧ.Ссылка.ИсторияИзмененияЭтапов[(СтрокаТЧ.Ссылка.ИсторияИзмененияЭтапов.Количество() - 1)].Дата + 60, "ДФ='гггг-ММ-дд ЧЧ:мм'");
			ДатаСделки = СтрокаТЧ.Ссылка.ИсторияИзмененияЭтапов[(СтрокаТЧ.Ссылка.ИсторияИзмененияЭтапов.Количество() - 1)].Дата + 60;
		КонецЕсли;
		МассивТелефонов = СтрокаТЧ.Ссылка.Контрагент.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон));
		МассивEmail = СтрокаТЧ.Ссылка.Контрагент.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты));

		JsonМассивOrders = JsonМассивOrders + "{
		|""id"": """          + СтрокаТЧ.Ссылка.УникальныйИдентификатор() 							 		  + """,
		|""name"": """ 		  + СтрокаТЧ.Ссылка.Наименование             	 								  + """,
		|""date_create"": """ + unixtime                                  									  + """,
		|""status"": """      + IdСтатуса                                 							 		  + """,
		|""price"": """       + ?(СтрокаТЧ.Ссылка.Прием.СуммаДокумента > 0, СтрЗаменить(Формат(СтрокаТЧ.Ссылка.Прием.СуммаДокумента, "ЧГ="),",","."), 0) + """,
		|""roistat"": """     + ?(СтрокаТЧ.Ссылка.Заявка.rs_vid = "", "Оффлайн сделка", СтрокаТЧ.Ссылка.Заявка.rs_vid)  + """,
		|""client_id"": """ + СтрокаТЧ.Ссылка.Контрагент.УникальныйИдентификатор() + """,
		|""manager_id"": """ + СтрокаТЧ.Ссылка.Менеджер.УникальныйИдентификатор() + """ }";
		//|""fields"": {" +
		//?(МассивТелефонов.Количество() > 0, """client_phone"": """ + МассивТелефонов[0].НомерТелефона + """ ", "") +
		//?(МассивEmail.Количество() > 0, ?(МассивТелефонов.Количество() = 0, """client_email"": """,",""client_email"": """) + МассивEmail[0].Представление + """", "") + "}}";
		
		ПервоеВхождение = Ложь;				 
		
	КонецЦикла;			 
	      
	Возврат JsonМассивOrders + "]";
	
КонецФункции	

// Функция возвращает json блок ид сделки.
//
Функция ПолучитьJsonБлокИдСделки(ИдСделки)
	
	Возврат "{
	|""status"" : ""ok"",
	|""order_id"" : """ + ИдСделки +"""
	|}";
	
КонецФункции	

// Функция, возвращает id тега по статусу.
//
Функция ПолучитьIdСтатуса(Статус)
	
	IdТега = 0;
	
	Если Статус.Ссылка.ИсторияИзмененияЭтапов.Количество() = 1 Тогда
		IdТега = 103;
	ИначеЕсли Статус.Ссылка.РезультатСделки = Перечисления.РезультатыСделок.Успех Тогда
		IdТега = 104;
	ИначеЕсли Статус.Ссылка.РезультатСделки = Перечисления.РезультатыСделок.Отказ Тогда
		IdТега = 105;
	Иначе	
		IdТега = 106;
	КонецЕсли;
	
	// Если Статус = Перечисления.СтатусыСквознойАналитики.ЗаявкаОтклонена Тогда
	//	IdТега = 101;	
	// ИначеЕсли Статус = Перечисления.СтатусыСквознойАналитики.ЗаявкаПринята Тогда
	//	IdТега = 102;
	// ИначеЕсли Статус = Перечисления.СтатусыСквознойАналитики.СделкаНеСостоялась Тогда
	//	IdТега = 105;
	// ИначеЕсли Статус = Перечисления.СтатусыСквознойАналитики.СделкаСоздана Тогда
	//	IdТега = 103;
	// ИначеЕсли Статус = Перечисления.СтатусыСквознойАналитики.СделкаСостоялась Тогда
	//	IdТега = 104;
	// ИначеЕсли Статус = Перечисления.СтатусыСквознойАналитики.СделкаНеСоздана Тогда
	//	IdТега = 105;
	// ИначеЕсли Статус = Перечисления.СтатусыСквознойАналитики.СделкаСменаЭтапа Тогда
	//	IdТега = 106;
	// КонецЕсли;	
	
	Возврат IdТега;
	
КонецФункции	

// Функция - Roistat GET.
//
Функция RoistatGET(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		    
		// Логирование
		ЛогироватьСобытие = Константы.ЛогироватьHTTP.Получить();	
		
		Если ЛогироватьСобытие > 0 Тогда
			ВремяНачалаОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
			UIDЗапроса     = Новый УникальныйИдентификатор();
			HTTPЗапросЛога = Запрос;
			ДатаЛога       = ТекущаяДатаСеанса();
			ТипЗапроса     = Перечисления.HTTPСервисы.Analytics;
			HTTPШаблон     = "Roistat";
		КонецЕсли;
		//\\
		
		// Получение информации о статусах
		Если Запрос.ПараметрыЗапроса.Получить("action")= "import_scheme" Тогда 
			
			Ответ = Новый HTTPСервисОтвет(200);	
			Ответ.Заголовки.Вставить("Content-Type", "application/json;  charset=utf-8");
			Ответ.УстановитьТелоИзСтроки(ПолучитьJsonСтруктуруСхемыИмпорта(), КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
			
			// Логирование
			Если ЛогироватьСобытие > 0 Тогда
				
				ВремяОкончанияОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
				ВремяВыполнения        = (ВремяОкончанияОперации - ВремяНачалаОперации)/1000;
				СтатусСобытия 		   = Перечисления.СтатусыЗапросов.Выполнен;						
				мОтвет                 = Ответ.ПолучитьТелоКакСтроку();
				
				Если ОбщегоНазначения.ВыполнитьЛогированиеЗапроса(ЛогироватьСобытие, СтатусСобытия, ВремяВыполнения) Тогда
					
					РегистрыСведений.ЖурналЗапросов.ЛогироватьЗапрос(
					HTTPЗапросЛога, 
					ДатаЛога, 
					UIDЗапроса, 
					ТипЗапроса, 
					HTTPШаблон, 
					СтатусСобытия, 
					ВремяВыполнения, 
					, 
					, 
					мОтвет, 
					, 
					,
					200); 								
				КонецЕсли;
				
			КонецЕсли;
			
			Возврат Ответ;
			
			// Получение информации о сделках	
		ИначеЕсли Запрос.ПараметрыЗапроса.Получить("action") = "export" Тогда 
			
			Ответ = Новый HTTPСервисОтвет(200);	
			Ответ.Заголовки.Вставить("Content-Type", "application/json;  charset=utf-8");
			ДатаСделок = Запрос.ПараметрыЗапроса.Получить("date");
			Ответ.УстановитьТелоИзСтроки(ПолучитьJsonСтруктуруЭкспортаЗаявок(ДатаСделок), КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
			// Логирование
			Если ЛогироватьСобытие > 0 Тогда
				
				ВремяОкончанияОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
				ВремяВыполнения        = (ВремяОкончанияОперации - ВремяНачалаОперации)/1000;
				СтатусСобытия 		   = Перечисления.СтатусыЗапросов.Выполнен;						
				мОтвет                 = Ответ.ПолучитьТелоКакСтроку();
				
				Если ОбщегоНазначения.ВыполнитьЛогированиеЗапроса(ЛогироватьСобытие, СтатусСобытия, ВремяВыполнения) Тогда
					
					РегистрыСведений.ЖурналЗапросов.ЛогироватьЗапрос(
					HTTPЗапросЛога, 
					ДатаЛога, 
					UIDЗапроса, 
					ТипЗапроса, 
					HTTPШаблон, 
					СтатусСобытия, 
					ВремяВыполнения, 
					, 
					, 
					мОтвет, 
					, 
					,
					200); 								
				КонецЕсли;
				
			КонецЕсли;
			
			Возврат Ответ;
			
		ИначеЕсли Запрос.ПараметрыЗапроса.Получить("action") = "lead" Тогда
			
			created_date = СтрЗаменить(Запрос.ПараметрыЗапроса.Получить("created_date"), "+", " ");
			title        = СтрЗаменить(Запрос.ПараметрыЗапроса.Получить("title"       ), "+", " ");
			name         = Запрос.ПараметрыЗапроса.Получить("name" );		
			visit        = Запрос.ПараметрыЗапроса.Получить("visit");
			phone        = Запрос.ПараметрыЗапроса.Получить("phone");	
			email        = Запрос.ПараметрыЗапроса.Получить("email");	
			data         = Запрос.ПараметрыЗапроса.Получить("data");
			text         = СтрЗаменить(Запрос.ПараметрыЗапроса.Получить("text"        ), "+", " ") + Символы.ПС + data;

			ВремяСоздания  = МестноеВремя(ПолучитьДатуИзСтрокиCoMagic(created_date));
			ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.Roistat, Истина);
			
			Клиент = Неопределено;
			Если ЗначениеЗаполнено(phone) Тогда
				Клиент = Справочники.Контрагенты.ПолучитьКонтрагентаПоНомеруТелефона(phone);
			КонецЕсли;			
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ОнлайнЗаявка", Истина);
			
			// Создаем входящую заявку.
			Заявка = Справочники.Заявки.СоздатьВходящуюЗаявку(,,
			ВремяСоздания,,
			name,,
			phone,
			email,,,,
			text,,
			ВнешняяСистема,,
			Клиент,,,
			ДополнительныеПараметры,,
			title);
			
			communication_id = Заявка.УникальныйИдентификатор();
			
			ЗаявкаОбъект = Заявка.ПолучитьОбъект();
			ЗаявкаОбъект.communication_id = communication_id;
			ЗаявкаОбъект.rs_vid           = visit; 
			ЗаявкаОбъект.Записать();
			
			Ответ = Новый HTTPСервисОтвет(200);	
			Ответ.Заголовки.Вставить("Content-Type", "application/json;  charset=utf-8");
			
			Ответ.УстановитьТелоИзСтроки(ПолучитьJsonБлокИдСделки(communication_id), КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
			        
			// Логирование
			Если ЛогироватьСобытие > 0 Тогда
				
				ВремяОкончанияОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
				ВремяВыполнения        = (ВремяОкончанияОперации - ВремяНачалаОперации)/1000;
				СтатусСобытия 		   = Перечисления.СтатусыЗапросов.Выполнен;						
				мОтвет                 = Ответ.ПолучитьТелоКакСтроку();
				
				Если ОбщегоНазначения.ВыполнитьЛогированиеЗапроса(ЛогироватьСобытие, СтатусСобытия, ВремяВыполнения) Тогда
					
					РегистрыСведений.ЖурналЗапросов.ЛогироватьЗапрос(
					HTTPЗапросЛога, 
					ДатаЛога, 
					UIDЗапроса, 
					ТипЗапроса, 
					HTTPШаблон, 
					СтатусСобытия, 
					ВремяВыполнения, 
					, 
					, 
					мОтвет, 
					, 
					,
					200); 								
				КонецЕсли;
				
			КонецЕсли;
			
			Возврат Ответ;
			
			//////////// Получение информации о клиентах
		ИначеЕсли Запрос.ПараметрыЗапроса.Получить("action") = "export_clients" Тогда
			
			Ответ = Новый HTTPСервисОтвет(200);	
			Ответ.Заголовки.Вставить("Content-Type", "application/json;  charset=utf-8");
			
			ДатаСделок = Запрос.ПараметрыЗапроса.Получить("date");
			
			Ответ.УстановитьТелоИзСтроки(ПолучитьJsonСтруктуруКлиентов(ДатаСделок), КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
			
			// Логирование
			Если ЛогироватьСобытие > 0 Тогда
				
				ВремяОкончанияОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
				ВремяВыполнения        = (ВремяОкончанияОперации - ВремяНачалаОперации)/1000;
				СтатусСобытия 		   = Перечисления.СтатусыЗапросов.Выполнен;						
				мОтвет                 = Ответ.ПолучитьТелоКакСтроку();
				
				Если ОбщегоНазначения.ВыполнитьЛогированиеЗапроса(ЛогироватьСобытие, СтатусСобытия, ВремяВыполнения) Тогда
					
					РегистрыСведений.ЖурналЗапросов.ЛогироватьЗапрос(
					HTTPЗапросЛога, 
					ДатаЛога, 
					UIDЗапроса, 
					ТипЗапроса, 
					HTTPШаблон, 
					СтатусСобытия, 
					ВремяВыполнения, 
					, 
					, 
					мОтвет, 
					, 
					,
					200); 								
				КонецЕсли;
				
			КонецЕсли;
			
			Возврат Ответ;
			
		Иначе
			
			// Логирование
			Если ЛогироватьСобытие > 0 Тогда
				
				ВремяОкончанияОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
				ВремяВыполнения        = (ВремяОкончанияОперации - ВремяНачалаОперации)/1000;
				СтатусСобытия 		   = Перечисления.СтатусыЗапросов.ЗавершенСОшибками;						
				
				РегистрыСведений.ЖурналЗапросов.ЛогироватьЗапрос(
				HTTPЗапросЛога, 
				ДатаЛога, 
				UIDЗапроса, 
				ТипЗапроса, 
				HTTPШаблон, 
				СтатусСобытия, 
				ВремяВыполнения, 
				ВнешняяСистема, 
				, 
				, 
				, 
				,
				400); 								
				
			КонецЕсли;
			
			Возврат Новый HTTPСервисОтвет(400);	
		КонецЕсли;
		
	Исключение
		
		// Логирование
		Если ЛогироватьСобытие > 0 Тогда
			
			ВремяОкончанияОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ВремяВыполнения        = (ВремяОкончанияОперации - ВремяНачалаОперации)/1000;
			ИнформацияОбОшибке     = ИнформацияОбОшибке();
			ОписаниеОшибки         = ИнформацияОбОшибке.Причина.Описание;
			Если СтрНайти(ИнформацияОбОшибке.Причина.Описание, "Превышено время ожидания") > 0 Тогда						
				СтатусСобытия = Перечисления.СтатусыЗапросов.TimedOut;
			Иначе
				СтатусСобытия = Перечисления.СтатусыЗапросов.ОшибкаСоединения;
			КонецЕсли;
			
			РегистрыСведений.ЖурналЗапросов.ЛогироватьЗапрос(
			HTTPЗапросЛога, 
			ДатаЛога, 
			UIDЗапроса, 
			ТипЗапроса, 
			HTTPШаблон, 
			СтатусСобытия, 
			ВремяВыполнения, 
			, 
			, 
			ОписаниеОшибки, 
			, 
			,
			400); 								
			
		КонецЕсли;
		
		Возврат Новый HTTPСервисОтвет(400);	 
		
	КонецПопытки;
	
	// Логирование
	Если ЛогироватьСобытие > 0 Тогда
		
		ВремяОкончанияОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ВремяВыполнения        = (ВремяОкончанияОперации - ВремяНачалаОперации)/1000;
		СтатусСобытия 		   = Перечисления.СтатусыЗапросов.Выполнен;						
		мОтвет                 = Ответ.ПолучитьТелоКакСтроку();
		
		Если ОбщегоНазначения.ВыполнитьЛогированиеЗапроса(ЛогироватьСобытие, СтатусСобытия, ВремяВыполнения) Тогда
			
			РегистрыСведений.ЖурналЗапросов.ЛогироватьЗапрос(
			HTTPЗапросЛога, 
			ДатаЛога, 
			UIDЗапроса, 
			ТипЗапроса, 
			HTTPШаблон, 
			СтатусСобытия, 
			ВремяВыполнения, 
			, 
			, 
			мОтвет, 
			, 
			,
			200); 								
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый HTTPСервисОтвет(200);

КонецФункции

#Область Comagic

// Функция, получает вебхуки с сервиса CoMagic.
//
Функция CoMagic_v2POST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВыполненоУспешно		= Истина;
	ВремяОкончанияОперации	= Неопределено;
	ОписаниеДляЛогирования	= ""; 
	ТранзакцияНачата		= Ложь;
	
	Попытка
		
		ТекстJSON     = Запрос.ПолучитьТелоКакСтроку();
		ЧтениеJSON    = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТекстJSON);
		ПараметрыJSON = ПрочитатьJSON(ЧтениеJSON);
		
		ApiKey         = Сред(Запрос.ОтносительныйURL, 13, СтрДлина(Запрос.ОтносительныйURL));
		ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(ApiKey, Перечисления.ТипыВнешнихСистем.CoMagic);
		
		// Логирование
		ЗначениеКонстантыЛогироватьСобытие = Константы.ЛогироватьHTTP.Получить();
		ЛогироватьСобытие = (ЗначениеКонстантыЛогироватьСобытие > 0);	
		ВремяНачалаОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		Если ЛогироватьСобытие Тогда			
			UIDЗапроса     = Новый УникальныйИдентификатор();
			HTTPЗапросЛога = Запрос;
			ДатаЛога       = ТекущаяДатаСеанса();
			ТипЗапроса     = Перечисления.HTTPСервисы.Analytics;
			HTTPШаблон     = "CoMagic_v2";
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ВнешняяСистема) Тогда
			Возврат Новый HTTPСервисОтвет(500);
		КонецЕсли;
		
		Метод = ?(ПараметрыJSON.Свойство("method"), ПараметрыJSON.method, Неопределено); 
		
		Если ЗначениеЗаполнено(Метод) Тогда
			
			// Проверка валидности ключа приложения.
			Если Метод = "key_validity" Тогда
				
				ЗначениеВозврата = Новый HTTPСервисОтвет(200);
				
				ВремяОкончанияОперации	= ТекущаяУниверсальнаяДатаВМиллисекундах();					
				ВремяВыполнения			= (ВремяОкончанияОперации - ВремяНачалаОперации)/1000;
				СтатусСобытия			= Перечисления.СтатусыЗапросов.Выполнен;	 
				КодВозврата				= 200;
				
				ЛогироватьСобытие	= ОбщегоНазначения.ВыполнитьЛогированиеЗапроса(ЗначениеКонстантыЛогироватьСобытие, СтатусСобытия, ВремяВыполнения);
							
			// Получение ключа Api.	
			ИначеЕсли Метод = "set_dataapi_key" Тогда
				
				dataapi_key = ?(ПараметрыJSON.Свойство("dataapi_key"), ПараметрыJSON.dataapi_key, Неопределено); 
				
				Если Не ЗначениеЗаполнено(dataapi_key) Тогда
					
					ЗначениеВозврата = Новый HTTPСервисОтвет(400, "Не заполнено значение dataapi");
					
					Если ЛогироватьСобытие Тогда						
						СтатусСобытия			= Перечисления.СтатусыЗапросов.ЗавершенСОшибками;						
						ОписаниеДляЛогирования	= ЗначениеВозврата.ПолучитьТелоКакСтроку();
						КодОтвета				= 400;													
					КонецЕсли;
					
				Иначе
					
					// Записываем ключ api во внешнюю систему.
					ОбъектВнешнейСистемы    = ВнешняяСистема.ПолучитьОбъект();	
					
					Если НЕ ОбъектВнешнейСистемы = Неопределено Тогда	
						
						ПараметрыВнешнейСистемы = ОбъектВнешнейСистемы.Параметры.Получить();
						
						Если НЕ ТипЗнч(ПараметрыВнешнейСистемы) = Тип("Структура") Тогда
							ПараметрыВнешнейСистемы = Новый Структура;
						КонецЕсли;	
						
						Если ПараметрыВнешнейСистемы.Свойство("Токен") Тогда           
							ПараметрыВнешнейСистемы.Токен = dataapi_key;
						Иначе
							ПараметрыВнешнейСистемы.Вставить("Токен", dataapi_key);
						КонецЕсли;
						
						ОбъектВнешнейСистемы.Параметры = Новый ХранилищеЗначения(ПараметрыВнешнейСистемы); 
						
						Попытка
							ОбъектВнешнейСистемы.Записать();
						Исключение
							ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Ошибка записи внешней системы при выполнении метода Comagic dataapi_key."
																					, УровеньЖурналаРегистрации.Ошибка,
																					, ВнешняяСистема
																					, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
						КонецПопытки;
						
						КодОтвета			= 200;
						ЗначениеВозврата	= Новый HTTPСервисОтвет(200);
						СтатусСобытия		= Перечисления.СтатусыЗапросов.Выполнен;
						
					Иначе
						
						КодОтвета			= 500;
						ЗначениеВозврата	= Новый HTTPСервисОтвет(500, "Ошибка записи внешней системы.");
						СтатусСобытия		= Перечисления.СтатусыЗапросов.ОшибкаВнешнейСистемы;
						
					КонецЕсли;
					
					ВремяОкончанияОперации	= ТекущаяУниверсальнаяДатаВМиллисекундах();
					ВремяВыполнения			= (ВремяОкончанияОперации - ВремяНачалаОперации)/1000; 
					ЛогироватьСобытие		= ОбщегоНазначения.ВыполнитьЛогированиеЗапроса(ЗначениеКонстантыЛогироватьСобытие, СтатусСобытия, ВремяВыполнения);
					
				КонецЕсли;
				
			Иначе
				
				ЗначениеВозврата = Новый HTTPСервисОтвет(400, "Не заполнено значение метода.");
				
				Если ЛогироватьСобытие Тогда					
					СтатусСобытия			= Перечисления.СтатусыЗапросов.ЗавершенСОшибками;						
					ОписаниеДляЛогирования	= ЗначениеВозврата.ПолучитьТелоКакСтроку();
					КодОтвета				= 400;													
				КонецЕсли;
				
			КонецЕсли;
						
		Иначе
			
			communication_id  	= ?(ПараметрыJSON.Свойство("communication_id"), ПараметрыJSON.communication_id, Неопределено);
			communication_type	= ?(ПараметрыJSON.Свойство("communication_type"), ПараметрыJSON.communication_type	, Неопределено);
			НомерТелефона 	  	= ?(ПараметрыJSON.Свойство("phone"), ПараметрыJSON.phone, Неопределено);
			НомерТелефона 	  	= ?(Не ЗначениеЗаполнено(НомерТелефона) И ПараметрыJSON.Свойство("visitor_phone_number"), ПараметрыJSON.visitor_phone_number, НомерТелефона);
			АдресЭП        	  	= ?(ПараметрыJSON.Свойство("email"), ПараметрыJSON.email, Неопределено);
			АдресЭП        	  	= ?(Не ЗначениеЗаполнено(АдресЭП) И ПараметрыJSON.Свойство("visitor_email"), ПараметрыJSON.visitor_email, АдресЭП);
			НаправлениеЗвонка 	= ?(ПараметрыJSON.Свойство("direction"), ПараметрыJSON.direction, Неопределено);
			
			Если Не ЗначениеЗаполнено(communication_id) Тогда
				Возврат Новый HTTPСервисОтвет(400, "Не заполнен communication_id");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НаправлениеЗвонка) И НаправлениеЗвонка = "out" Тогда
				Возврат Новый HTTPСервисОтвет(200, "Исходящий звонок");
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(НомерТелефона) И Не ЗначениеЗаполнено(АдресЭП) Тогда
				Возврат Новый HTTPСервисОтвет(400, "Не заполнен номер телефона и адрес электронной почты");
			КонецЕсли;
			
			Клиент = Неопределено;
			Заявка = Неопределено;
			
			Если ЗначениеЗаполнено(НомерТелефона) Тогда
				Клиент = Справочники.Контрагенты.ПолучитьКонтрагентаПоНомеруТелефона(НомерТелефона);
				Если Не ЗначениеЗаполнено(Клиент) Тогда
					Заявка = ПолучитьЗаявкуПоНомеруТелефона(НомерТелефона);
				КонецЕсли;	
			КонецЕсли;
			
			communication_type = ПолучитьТипОбращения(communication_type);
			КаналПривлечения   = ПолучитьКаналПривлечения(communication_type);
			
			Если (Не ЗначениеЗаполнено(Клиент) И Не ЗначениеЗаполнено(Заявка)) ИЛИ КаналПривлечения = Справочники.КаналыПривлечения.ЛидФорма Тогда
				
				campaign_name			= ?(ПараметрыJSON.Свойство("campaign_name")		, ПараметрыJSON.campaign_name		, Неопределено);
				ИмяСобытия				= ?(ПараметрыJSON.Свойство("notification_name")	, ПараметрыJSON.notification_name	, Неопределено);
				ВремяСозданияСтрокой	= ?(ПараметрыJSON.Свойство("notification_time")	, ПараметрыJSON.notification_time	, Неопределено);
				ДоменноеИмя				= ?(ПараметрыJSON.Свойство("site_domain_name")	, ПараметрыJSON.site_domain_name	, Неопределено);
				ИмяКлиента				= ?(ПараметрыJSON.Свойство("name")				, ПараметрыJSON.name				, Неопределено);
				ФамилияКлиента			= ?(ПараметрыJSON.Свойство("last_name")			, ПараметрыJSON.last_name			, Неопределено);
				МассивСообщений			= ?(ПараметрыJSON.Свойство("messages")			, ПараметрыJSON.messages			, Неопределено);
				Сообщение				= ?(ПараметрыJSON.Свойство("message")			, ПараметрыJSON.message				, Неопределено);					
				utm_campaign			= ?(ПараметрыJSON.Свойство("utm_campaign")		, ПараметрыJSON.utm_campaign		, Неопределено);
				utm_content				= ?(ПараметрыJSON.Свойство("utm_content")		, ПараметрыJSON.utm_content			, Неопределено);
				utm_medium				= ?(ПараметрыJSON.Свойство("utm_medium")		, ПараметрыJSON.utm_medium			, Неопределено);
				utm_source				= ?(ПараметрыJSON.Свойство("utm_source")		, ПараметрыJSON.utm_source			, Неопределено);
				eq_utm_source			= ?(ПараметрыJSON.Свойство("eq_utm_source")		, ПараметрыJSON.eq_utm_source		, Неопределено);
				utm_term				= ?(ПараметрыJSON.Свойство("utm_term")			, ПараметрыJSON.utm_term			, Неопределено);
								
				Если ТипЗнч(communication_id) = Тип("Число") Тогда
					communication_id = Формат(communication_id, "ЧГ=");	
				КонецЕсли;
				
				НачатьТранзакцию();
				ТранзакцияНачата = Истина;
				
				УстановитьБлокировку("Справочник.Заявки", "communication_id", communication_id);

				Если Не ЗначениеЗаполнено(ИмяКлиента) Тогда
					ИмяКлиента = ?(ЗначениеЗаполнено(НомерТелефона), НомерТелефона, АдресЭП);
				КонецЕсли;	
				
				ПараметрыВС = ВнешняяСистема.Параметры.Получить();
				Если ТипЗнч(ПараметрыВС) = Тип("Структура") И ЗначениеЗаполнено(ПараметрыВС) И ПараметрыВС.Свойство("МассивСтруктурныхЕдиниц") Тогда			
					МассивСтруктурныхЕдиниц = ПараметрыВС.МассивСтруктурныхЕдиниц;			
				КонецЕсли;	
				
				СтруктурнаяЕдиница = Неопределено;
				
				Если ЗначениеЗаполнено(МассивСтруктурныхЕдиниц) И ТипЗнч(МассивСтруктурныхЕдиниц) = Тип("Массив") И ЗначениеЗаполнено(ДоменноеИмя) Тогда
					
					Для Каждого ЭлементМ Из МассивСтруктурныхЕдиниц Цикл
						
						Если ДоменноеИмя = ЭлементМ.ДоменноеИмя Тогда
							СтруктурнаяЕдиница = ЭлементМ.СтруктурнаяЕдиница;
							Прервать;
						КонецЕсли;
						
					КонецЦикла;	
					
				КонецЕсли;	
				
				Если Не ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
					СтруктурнаяЕдиница = ВнешняяСистема.СтруктурнаяЕдиница;
				КонецЕсли;	
				
				ВремяСоздания = ПолучитьДатуИзСтрокиCoMagic(ВремяСозданияСтрокой);
				
				ПараметрыUTM = Новый Структура();
				ПараметрыUTM.Вставить("source", ?(ЗначениеЗаполнено(eq_utm_source), eq_utm_source, utm_source));
				ПараметрыUTM.Вставить("medium", utm_medium);
				ПараметрыUTM.Вставить("campaign", utm_campaign);
				ПараметрыUTM.Вставить("content", utm_content);
				ПараметрыUTM.Вставить("term", utm_term);
				
				Комментарий = "" + ИмяСобытия + ?(ЗначениеЗаполнено(Сообщение), ?(ЗначениеЗаполнено(ИмяСобытия), Символы.ПС, "") + Сообщение, "");
				
				РекламныйИсточникПоМеткамUTM = Справочники.РекламныеИсточники.ПолучитьРекламныйИсточникПоПараметрамЗаявки(ПараметрыUTM);
				Если РекламныйИсточникПоМеткамUTM = Неопределено Тогда
					РекламныйИсточник = Справочники.РекламныеИсточники.ПолучитьРекламныйИсточник(?(ЗначениеЗаполнено(campaign_name), campaign_name, utm_source), Истина);
				Иначе
					РекламныйИсточник = РекламныйИсточникПоМеткамUTM;
				КонецЕсли;
				
				ЗаявкаCoMagic = ПолучитьЗаявкуКлиентаComagic(communication_id);
				
				Если ЗаявкаCoMagic <> Неопределено Тогда
					
					ЗаявкаОбъект					= ЗаявкаCoMagic.ПолучитьОбъект();					
					ЗаявкаОбъект.utm_source   		= ?(ЗначениеЗаполнено(ПараметрыUTM.source) И Не ЗначениеЗаполнено(ЗаявкаОбъект.utm_source)		, ПараметрыUTM.source	, ЗаявкаОбъект.utm_source);
					ЗаявкаОбъект.utm_medium   		= ?(ЗначениеЗаполнено(ПараметрыUTM.medium) И Не ЗначениеЗаполнено(ЗаявкаОбъект.utm_medium)		, ПараметрыUTM.medium  	, ЗаявкаОбъект.utm_medium);
					ЗаявкаОбъект.utm_campaign 		= ?(ЗначениеЗаполнено(ПараметрыUTM.campaign) И Не ЗначениеЗаполнено(ЗаявкаОбъект.utm_campaign)	, ПараметрыUTM.campaign	, ЗаявкаОбъект.utm_campaign);
					ЗаявкаОбъект.utm_content  		= ?(ЗначениеЗаполнено(ПараметрыUTM.content) И Не ЗначениеЗаполнено(ЗаявкаОбъект.utm_content)	, ПараметрыUTM.content 	, ЗаявкаОбъект.utm_content);
					ЗаявкаОбъект.utm_term     		= ?(ЗначениеЗаполнено(ПараметрыUTM.term) И Не ЗначениеЗаполнено(ЗаявкаОбъект.utm_term)			, ПараметрыUTM.term    	, ЗаявкаОбъект.utm_term);
					ЗаявкаОбъект.РекламныйИсточник	= ?(ЗначениеЗаполнено(РекламныйИсточник) И Не ЗначениеЗаполнено(ЗаявкаОбъект.РекламныйИсточник)	, РекламныйИсточник		, ЗаявкаОбъект.РекламныйИсточник);
					
					Попытка
						ЗаявкаОбъект.Записать();
						ЗафиксироватьТранзакцию();
						ОписаниеОтвета = "Заявка с таким communication_id обновлена.";
					Исключение
						ОтменитьТранзакцию();
						ОписаниеОтвета = СтрШаблон("Не удалось обновить заявку по причине %1", ОписаниеОшибки());
					КонецПопытки;
					
					Возврат Новый HTTPСервисОтвет(200, ОписаниеОтвета);
					
				КонецЕсли;
				
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("ОнлайнЗаявка", Истина);
				
				// Создаем входящую заявку.
				Заявка = Справочники.Заявки.СоздатьВходящуюЗаявку(
				communication_id,
				communication_type,
				ВремяСоздания,,
				ИмяКлиента,
				ФамилияКлиента,
				НомерТелефона,
				АдресЭП,
				РекламныйИсточник,
				КаналПривлечения,,
				Комментарий,
				ПараметрыUTM,
				ВнешняяСистема,,
				Клиент,
				СтруктурнаяЕдиница,,
				ДополнительныеПараметры);
				
			КонецЕсли;		
			
			КодОтвета				= 200;
			ВремяОкончанияОперации	= ТекущаяУниверсальнаяДатаВМиллисекундах();
			ВремяВыполнения			= (ВремяОкончанияОперации - ВремяНачалаОперации)/1000;
			СтатусСобытия			= Перечисления.СтатусыЗапросов.Выполнен;	
			
			ЛогироватьСобытие		= ОбщегоНазначения.ВыполнитьЛогированиеЗапроса(ЗначениеКонстантыЛогироватьСобытие, СтатусСобытия, ВремяВыполнения);
			
			ЗначениеВозврата		= Новый HTTPСервисОтвет(200);
			
		КонецЕсли;
		
	Исключение
		
		ВыполненоУспешно		= Ложь;		
		КодОтвета				= 400;
		СтатусСобытия			= Перечисления.СтатусыЗапросов.ЗавершенСОшибками;		
		ОписаниеДляЛогирования	= ОписаниеОшибки();
		
		ЗначениеВозврата		= Новый HTTPСервисОтвет(400, ОписаниеДляЛогирования);
		
	КонецПопытки;
	
	// Логирование.
	Если ЛогироватьСобытие Тогда
		
		ВремяОкончанияОперации = ?(ЗначениеЗаполнено(ВремяОкончанияОперации), ВремяОкончанияОперации, ТекущаяУниверсальнаяДатаВМиллисекундах());
		ВремяВыполнения        = (ВремяОкончанияОперации - ВремяНачалаОперации)/1000;
		
		РегистрыСведений.ЖурналЗапросов.ЛогироватьЗапрос(
		HTTPЗапросЛога, 
		ДатаЛога, 
		UIDЗапроса, 
		ТипЗапроса, 
		HTTPШаблон, 
		СтатусСобытия, 
		ВремяВыполнения, 
		ВнешняяСистема, 
		ApiKey, 
		ОписаниеДляЛогирования, 
		, 
		,
		КодОтвета); 								
		
	КонецЕсли;
	
	Если ТранзакцияНачата Тогда
		Если ВыполненоУспешно Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
		КонецЕсли;
	КонецЕсли;

	Возврат ЗначениеВозврата;
	
КонецФункции

// Функция, возвращает Истина если заявка с таким номером телефона уже существует.
//
Функция ПолучитьЗаявкуПоНомеруТелефона(Знач НомерТелефона)
	
	МассивНомеровТелефонов = Новый Массив;
	МассивНомеровТелефонов.Добавить(НомерТелефона);
	НомерБезПлюса = СтрЗаменить(НомерТелефона, "+", "");
	МассивНомеровТелефонов.Добавить(НомерБезПлюса);
	МассивНомеровТелефонов.Добавить("7" + Сред(НомерБезПлюса, 2));
	МассивНомеровТелефонов.Добавить("8" + Сред(НомерБезПлюса, 2));
	МассивНомеровТелефонов.Добавить("+7" + Сред(НомерБезПлюса, 2));
	МассивНомеровТелефонов.Добавить("+8" + Сред(НомерБезПлюса, 2));
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЗаявкиКонтактнаяИнформация.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Заявки.КонтактнаяИнформация КАК ЗаявкиКонтактнаяИнформация
	|ГДЕ
	|	НЕ ЗаявкиКонтактнаяИнформация.Ссылка.ПометкаУдаления
	|	И ЗаявкиКонтактнаяИнформация.Ссылка.ВнешняяСистема.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.CoMagic)
	|	И ЗаявкиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И (ЗаявкиКонтактнаяИнформация.НомерТелефона В (&МассивНомеровТелефонов)
	|			ИЛИ ВЫРАЗИТЬ(ЗаявкиКонтактнаяИнформация.Представление КАК СТРОКА(200)) В (&МассивНомеровТелефонов))";
	
	Запрос.УстановитьПараметр("МассивНомеровТелефонов", МассивНомеровТелефонов);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Возврат ?(РезультатЗапроса.Следующий(), РезультатЗапроса.Ссылка, Справочники.Заявки.ПустаяСсылка());
	
КонецФункции

// Фукнция, возвращает тип обращения CoMajic
//
Функция ПолучитьТипОбращения(communication_type)
	
	ТипОбращения = Перечисления.ТипыОбращенийCoMagic.ПустаяСсылка();
	
	Если communication_type = "call" Тогда 
		ТипОбращения = Перечисления.ТипыОбращенийCoMagic.call;
	ИначеЕсли communication_type = "chat" Тогда 
		ТипОбращения = Перечисления.ТипыОбращенийCoMagic.chat;	
	ИначеЕсли communication_type = "goal" Тогда 
		ТипОбращения = Перечисления.ТипыОбращенийCoMagic.goal;	
	ИначеЕсли communication_type = "offline_message" Тогда 
		ТипОбращения = Перечисления.ТипыОбращенийCoMagic.offline_message;	
	КонецЕсли;	
	
	Возврат ТипОбращения;
	
КонецФункции

// Функция, возвращает канал привлечения.
//
Функция ПолучитьКаналПривлечения(ТипОбращения)
	
	КаналПривлечения = Перечисления.ТипыОбращенийCoMagic.ПустаяСсылка();
	
	Если ТипОбращения = Перечисления.ТипыОбращенийCoMagic.call Тогда 
		КаналПривлечения = Справочники.КаналыПривлечения.ВходящийЗвонок;
	ИначеЕсли ТипОбращения = Перечисления.ТипыОбращенийCoMagic.chat Тогда 
		КаналПривлечения = Справочники.КаналыПривлечения.ЧатСКлиентом;	
	ИначеЕсли ТипОбращения = Перечисления.ТипыОбращенийCoMagic.goal Тогда 
		КаналПривлечения = Справочники.КаналыПривлечения.ЛовецЛидов;	
	ИначеЕсли ТипОбращения = Перечисления.ТипыОбращенийCoMagic.offline_message Тогда 
		КаналПривлечения = Справочники.КаналыПривлечения.ЛидФорма;	
	КонецЕсли;	
	
	Возврат КаналПривлечения;
	
КонецФункции	

// Функция, возвращает заявку клиента CoMagic.
//
Функция ПолучитьЗаявкуКлиентаComagic(communication_id)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Заявки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Заявки КАК Заявки
	|ГДЕ
	|	НЕ Заявки.ПометкаУдаления
	|	И Заявки.ВнешняяСистема.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.CoMagic)
	|	И Заявки.communication_id = &communication_id");
	
	Запрос.УстановитьПараметр("communication_id" , communication_id);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
	
КонецФункции

#КонецОбласти

// Процедура, устанавливает блокировку.
Процедура УстановитьБлокировку(БлокируемыйДокумент, РеквизитБлокировки, ЗначениеРеквизита)
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(БлокируемыйДокумент);
	ЭлементБлокировки.УстановитьЗначение(РеквизитБлокировки, ЗначениеРеквизита);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
КонецПроцедуры

#КонецОбласти
